//Сформувати файл loop.js, у якому створити по одному циклу проходу від 0 до 9,
//  на кожній ітерації якого виводитиметься значення поточного ітератора.
// Потім по одному циклу від 100 до 0 з кроком 10, де виводитиметься ітератор на кожній ітерації.

let i = 0;
while (i < 10) {
    console.log(i);
    i++;
};

console.log('-------------');

let k = 9;
do {
    console.log(k);
    k--;
} while (k >= 0);

console.log('-------------');

for (let i = 100; i >= 0; i -= 10) {
    console.log(i);
}

console.log('-------------');

for (let i = 100; i >= 0; i -= 10) {
    if ( i % 25 ) {
        continue;
    }
    console.log(i);
}
